; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p3---int100n150-m25---int100c200---s9---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level22 level22)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level22 level23)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level22 level24)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level22 level25)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level22 level26)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level22 level27)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level22 level28)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level22 level29)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level22 level30)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level22 level31)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level22 level32)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level27 level4 level31)
(sum level28 level4 level32)

(connected l0 l1)
(fuelcost level6 l0 l1)
(connected l0 l2)
(fuelcost level22 l0 l2)
(connected l1 l0)
(fuelcost level6 l1 l0)
(connected l1 l2)
(fuelcost level4 l1 l2)
(connected l2 l0)
(fuelcost level22 l2 l0)
(connected l2 l1)
(fuelcost level4 l2 l1)

(at t0 l1)
(fuel t0 level32)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 3
2. (drive t0 l1 l0 level26 level6 level32)
   deleted: (at t0 l1) (fuel t0 level32)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 0 of 3
3. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 3
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 3
5. (drive t0 l0 l2 level4 level22 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l2) (fuel t0 level4)
   goals met: 0 of 3
6. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 1 of 3
7. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 3
8. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 3
